nxp-appcodehub/dm-usb-audio-7-1-channel-speaker-on-mcxn947/source/audio_speaker.c
    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_InitDebugConsole();

    dmaTxConfig.instance            = DEMO_DMA_INDEX;
    dmaTxConfig.channel             = DEMO_DMA_TX_CHANNEL;
    dmaTxConfig.priority            = kHAL_AudioDmaChannelPriorityDefault;
    dmaTxConfig.dmaChannelMuxConfig = (void *)&dmaChannelSource;
    ipTxConfig.sai.lineMask         = 1U << 0U;
    ipTxConfig.sai.syncMode         = kHAL_AudioSaiModeAsync;
    audioTxConfig.dmaConfig         = &dmaTxConfig;
    audioTxConfig.ipConfig          = &ipTxConfig;
    audioTxConfig.instance          = DEMO_SAI_INSTANCE_INDEX;
    audioTxConfig.srcClock_Hz       = DEMO_SAI_CLK_FREQ;
    audioTxConfig.sampleRate_Hz     = (uint32_t)kHAL_AudioSampleRate48KHz;
    audioTxConfig.msaterSlave       = kHAL_AudioMaster;
    audioTxConfig.bclkPolarity      = kHAL_AudioSampleOnRisingEdge;
    audioTxConfig.frameSyncPolarity = kHAL_AudioBeginAtFallingEdge;
#if ((defined(USB_AUDIO_CHANNEL7_1) && (USB_AUDIO_CHANNEL7_1 > 0U)) || \
     (defined(USB_AUDIO_CHANNEL5_1) && (USB_AUDIO_CHANNEL5_1 > 0U)) || \
     (defined(USB_AUDIO_CHANNEL3_1) && (USB_AUDIO_CHANNEL3_1 > 0U)))
    audioTxConfig.frameSyncWidth = kHAL_AudioFrameSyncWidthOneBitClk;
    audioTxConfig.dataFormat     = kHAL_AudioDataFormatDspModeA;
    audioTxConfig.bitWidth       = (uint8_t)kHAL_AudioWordWidth32bits;
    audioTxConfig.lineChannels   = kHAL_AudioStereo8Channel;
#else
    audioTxConfig.frameSyncWidth = kHAL_AudioFrameSyncWidthHalfFrame;
    audioTxConfig.dataFormat     = kHAL_AudioDataFormatI2sClassic;
    audioTxConfig.bitWidth       = (uint8_t)kHAL_AudioWordWidth16bits;
    audioTxConfig.lineChannels   = kHAL_AudioStereo;
#endif

    CoreDebug->DEMCR |= (1 << CoreDebug_DEMCR_TRCENA_Pos);
    DWT->CTRL |= (1 << DWT_CTRL_CYCCNTENA_Pos);
    
    //Enable Audio DC Power
    GPIO_PinInit(DEMO_DC_ENABLE_GPIO, DEMO_DC_ENABLE_GPIO_PIN, &gpio_config);
    GPIO_PinWrite(DEMO_DC_ENABLE_GPIO, DEMO_DC_ENABLE_GPIO_PIN, 1U);

    APPInit();

    while (1)
    {
        USB_AudioCodecTask();

        USB_AudioSpeakerResetTask();

#if USB_DEVICE_CONFIG_USE_TASK
        USB_DeviceTaskFn(g_UsbDeviceAudioSpeaker.deviceHandle);
#endif
    }
}
